In [2]:
#Import denpendacies
import pandas as pd
import numpy as np

In [3]:
#Set input file
task1_file = "Resources/budget_data.csv"

In [4]:
#read in file
budget_df = pd.read_csv(task1_file)
budget_df.head(10)

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503
5  Jun-2010         522857
6  Jul-2010        1033096
7  Aug-2010         604885
8  Sep-2010        -216386
9  Oct-2010         477532

In [5]:
budget_df.dtypes
budget_df.count()

Date             86
Profit/Losses    86
dtype: int64

In [6]:
#get the months out of the dates
budget_df["Month"] = budget_df["Date"].str[:3]
budget_df.head(10)

       Date  Profit/Losses Month
0  Jan-2010         867884   Jan
1  Feb-2010         984655   Feb
2  Mar-2010         322013   Mar
3  Apr-2010         -69417   Apr
4  May-2010         310503   May
5  Jun-2010         522857   Jun
6  Jul-2010        1033096   Jul
7  Aug-2010         604885   Aug
8  Sep-2010        -216386   Sep
9  Oct-2010         477532   Oct

In [7]:
#get the year out of the dates
budget_df["Year"] = budget_df["Date"].str[-4:]
budget_df.head(10)

       Date  Profit/Losses Month  Year
0  Jan-2010         867884   Jan  2010
1  Feb-2010         984655   Feb  2010
2  Mar-2010         322013   Mar  2010
3  Apr-2010         -69417   Apr  2010
4  May-2010         310503   May  2010
5  Jun-2010         522857   Jun  2010
6  Jul-2010        1033096   Jul  2010
7  Aug-2010         604885   Aug  2010
8  Sep-2010        -216386   Sep  2010
9  Oct-2010         477532   Oct  2010

In [8]:
#number of months in the data
months = budget_df["Month"]
len(months)

86

In [9]:
budget_df["Year"].unique()
budget_df.dtypes

Date             object
Profit/Losses     int64
Month            object
Year             object
dtype: object

In [10]:
#total profit/loss in the dataset
tot_profit_loss = budget_df["Profit/Losses"].sum()
tot_profit_loss

38382578

In [10]:
#Get the change in profit/loss from year to year
budget_df["Change"] = budget_df["Profit/Losses"].diff()
budget_df

        Date  Profit/Losses Month  Year  % Change    Change
0   Jan-2010         867884   Jan  2010       NaN       NaN
1   Feb-2010         984655   Feb  2010      0.13  116771.0
2   Mar-2010         322013   Mar  2010     -0.67 -662642.0
3   Apr-2010         -69417   Apr  2010     -1.22 -391430.0
4   May-2010         310503   May  2010     -5.47  379920.0
..       ...            ...   ...   ...       ...       ...
81  Oct-2016         102685   Oct  2016     -0.87 -665765.0
82  Nov-2016         795914   Nov  2016      6.75  693229.0
83  Dec-2016          60988   Dec  2016     -0.92 -734926.0
84  Jan-2017         138230   Jan  2017      1.27   77242.0
85  Feb-2017         671099   Feb  2017      3.85  532869.0

[86 rows x 6 columns]

In [9]:
#calcualte percent change - not needed
budget_df["% Change"] = round(budget_df["Profit/Losses"].pct_change(),2)
budget_df

        Date  Profit/Losses Month  Year  % Change
0   Jan-2010         867884   Jan  2010       NaN
1   Feb-2010         984655   Feb  2010      0.13
2   Mar-2010         322013   Mar  2010     -0.67
3   Apr-2010         -69417   Apr  2010     -1.22
4   May-2010         310503   May  2010     -5.47
..       ...            ...   ...   ...       ...
81  Oct-2016         102685   Oct  2016     -0.87
82  Nov-2016         795914   Nov  2016      6.75
83  Dec-2016          60988   Dec  2016     -0.92
84  Jan-2017         138230   Jan  2017      1.27
85  Feb-2017         671099   Feb  2017      3.85

[86 rows x 5 columns]

In [11]:
max_change = budget_df["Change"].max()
max_change

1926159.0

In [12]:
min_change = budget_df["Change"].min()
min_change

-2196167.0

In [15]:
#row with max and min change
max_chnge_row = budget_df.loc[budget_df["Change"] == max_change]
max_chnge_row

        Date  Profit/Losses Month  Year  % Change     Change
25  Feb-2012        1170593   Feb  2012     -2.55  1926159.0

In [16]:
min_chnge_row = budget_df.loc[budget_df["Change"] == min_change]
min_chnge_row

        Date  Profit/Losses Month  Year  % Change     Change
44  Sep-2013       -1196225   Sep  2013      -2.2 -2196167.0